# -*- coding:utf-8 -*-
# 파이썬 2 : 기본 인코딩이 ascii 코드 라서 한글 디코딩 불가
# 파이썬 3 : 기본 인코딩이 utf-8, 굳이 쓰지 않아도 됨
#            다른 개발 환경 or 다른 툴 사용할 때 명시하는건 좋음

# Python
#    [Big Data, AI]
#    분석용 데이터 구축
#        - 직접 : 출퇴근 시간에 노약자석을 체크
#        - 누군가가 모아놓은 데이터를 구매
#        - 두가지 방법을 모두 사용할 수 없는 경우 
#            -> 웹 데이터 가져오기 (XML, JSON, HTML)
#       분석 - 사람 -> BigData 분석 프로젝트
#       분석 - A.I -> AI 프로젝트
#       결과를 한 눈에 알아보기 쉽게 시각화 (표 / 그래프 / etc)

#     -> Python은 빅데이터 분석용 도구인가?
#            X, 프로그래밍 언어이다

#############################################################
#         Java vs Python
#############################################################

# Java    : 규칙의 언어
#            필수적으로 JDK 설치
#            컴파일러 방식
#            OOP의 코드를 재사용 하기 위해 1file = 1 class 


# Python  : 자유의 언어 
#            필수)
#             python 설치 (ver 3.8.3)
#                -> 개발툴 IDLE이 함께 설치됨
#             Add Python 3.8 Path 체크 - cmd환경에서 명령어를 쓰기 편하게 만듬
#            옵션)
#                eclipse에서 pydev 추가
#                (intelliJ, pycham, ... etc)
#                Project는 단순한 폴더의 역할
#                인터프리터 방식
#                OOP의 코드 재사용 -> 신경 쓰지 않음
#############################################################

# Bing Data : 
#    1) python : 분석용 데이터 구축
#    2) Hadoop: 리눅스 환경에서 데이터 분석
#    3) R, python : 시각화

#    데이터 구축
#    1) python으로 xml/ dta => 데이터 베이스로 이동
#    2) DB에 있는 데이터를 분석용 파일로 분석 (.csv, .txt파일, etc)

#############################################################





































































